УТ_для_edt/src/Documents/смартЛид/смартЛид.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартЛид</name>
  <comment>//++ #1543 смарт: Фролов 08.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПолученияЛида</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЛида</name>
    <type>
      <types>EnumRef.смартСостоянияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИсточника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатыПоискаПоКИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегионТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.смартКвалификацииМенеджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заметка</name>
    <type>
      <types>CatalogRef.Заметки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСменыОтветственного</name>
    <type>
      <types>CatalogRef.смартПричиныСменыОтветственных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Распределил</name>
    <comment>//++ #1835 смарт: Фролов 28.05.2024 //Доработка рабочего места секретаря</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Yclid_Метка</name>
    <comment>//++ #1941 смарт: Фролов 22.07.2024 //Добавить реквизит &quot;yclid&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ClientID</name>
    <comment>#1958 смарт: Лопато 05.08.2024 //Добавить реквизит &quot;ClientID&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JSON_ИМ_Регистрация</name>
    <comment>//++ #Б-986 смарт: Фролов 23.09.2024 //ИМ. Регистрация пользователя на сайте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Roistat_visit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоОповещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартКоэффициентыМенеджеров/смартКоэффициентыМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартКоэффициентыМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 15.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзменениеКоэффициента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыдачаЗаблокирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыдачаЗаблокированаВручную</name>
    <comment>//++ #Б-3704 смарт: Фролов 07.07.2025 //Корректировка данных по отпускам и блокирование выдачи Интересов на основании данных регистра &quot;График отсутствия сотрудников&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКоэффициента</name>
    <type>
      <types>EnumRef.смартВидыКоэффициентовМенеджеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСостоянияЛидов/смартСостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСостоянияЛидов</name>
  <comment>//++ #1624 смарт: Фролов 14.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.</comment>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенУспешно</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенНеУспешно</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВидыКоэффициентовМенеджеров/смартВидыКоэффициентовМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыКоэффициентовМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 07.12.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <enumValues>
    <name>ИтоговыйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтВыручки</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКонверсии</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтПотериЛидов</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКоммерческогоОтдела</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтМаркетинговогоОтдела</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ТипыТекстовЭлектронныхПисем/ТипыТекстовЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовЭлектронныхПисем</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
  <enumValues>
    <name>HTMLСКартинками</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заметки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметЗаметок</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСодержания</name>
    <comment>Реквизит для полнотекстового поиска</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляРабочегоСтола</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <type>
      <types>EnumRef.ЦветаЗаметок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПредмета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаметки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЗаметкаЛенты</name>
    <comment>Служебный реквизит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартИсточник</name>
    <comment>//++ #1624 смарт: Фролов 14.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.</comment>
    <type>
      <types>DocumentRef.смартЛид</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСовет</name>
    <comment>//++ #1698 смарт: Фролов 27.03.2024 //Оповещение Маркетинга и Коммерции о результатах обработки интереса менеджером.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартКвалификация</name>
    <comment>//++ #1833 смарт: Фролов 27.05.2024 //Автоматическое создание заметок при квалификации интереса.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПартнер</name>
    <comment>//++ #1981 смарт: Фролов 21.08.2024 //Показ заметок по результатам квалификации Интереса в карточке Партнера.</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>смартСтатусыВзаимоотношенийСКлиентомПоЗаметке</name>
    <comment>//++ #1313 смарт: Фролов 15.02.2023 //смартСтатусыВзаимоотношенийСКлиентомПоЗаметке</comment>
    <attributes>
      <name>смартСтатусВзаимоотношенийСКлиентом</name>
      <comment>//++ #1313 смарт: Фролов 15.02.2023 //смартСтатусыВзаимоотношенийСКлиентомПоЗаметке</comment>
      <type>
        <types>CatalogRef.смартСтатусыВзаимоотношенийСКлиентами</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартЛид/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//++ #1623 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Форма добавления лида вручную
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	//-- #1623 смарт: Фролов 13.02.2024
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	УстановитьУсловноеОформление();
	
	//Переопеределяемый модуль
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Переопеределяемый модуль
	
	//++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		
		Элементы.СоздатьКлиента.Видимость = Ложь;
		
	КонецЕсли;
	
	Заметки.Параметры.УстановитьЗначениеПараметра("Лид", Объект.Ссылка);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартЛид.Дата КАК Дата,
	|	смартЛид.Ссылка КАК Ссылка,
	|	смартЛид.ТипТовара КАК ТипТовара,
	|	смартЛид.Продукт КАК Продукт,
	|	смартЛид.СостояниеЛида КАК СостояниеЛида,
	|	смартЛид.Ответственный КАК Ответственный,
	|	смартЛид.Имя КАК Имя,
	|	смартЛид.БизнесРегион КАК БизнесРегион,
	|	смартЛид.Номер КАК Номер,
	|	смартЛид.Партнер КАК Клиент
	|ИЗ
	|	Документ.смартЛид КАК смартЛид
	|ГДЕ
	|	(смартЛид.Партнер = &Партнер
	|			ИЛИ смартЛид.ЭлектроннаяПочта = &ЭлектроннаяПочта
	|			ИЛИ смартЛид.КонтактноеЛицо = &КонтактноеЛицо
	|			ИЛИ смартЛид.Телефон = &Телефон)
	|	И НЕ смартЛид.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Партнер", ?(Объект.Партнер.Пустая(), "ХХХХХХХХХХХХХ", Объект.Партнер));
	Запрос.УстановитьПараметр("ЭлектроннаяПочта", ?(Объект.ЭлектроннаяПочта = "", "ХХХХХХХХХХХХХ", Объект.ЭлектроннаяПочта));
	Запрос.УстановитьПараметр("КонтактноеЛицо", ?(Объект.КонтактноеЛицо.Пустая(), "ХХХХХХХХХХХХХ", Объект.КонтактноеЛицо));
	Запрос.УстановитьПараметр("Телефон", ?(Объект.Телефон = "", "ХХХХХХХХХХХХХ", Объект.Телефон));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЭтаФорма.ИсторияЛидов.Загрузить(Результат);
	
	ЭтаФорма.Элементы.СтраницаИсторияЛидов.Заголовок = "Другие лиды клиента (" + Результат.Количество() + ")";
	
	Если ЗначениеЗаполнено(Объект.Квалификация) Тогда
		ЗаполнитьСписокВыбораОтветственных();	
	КонецЕсли;	
	//-- #1624 смарт: Фролов 13.02.2024
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(ЭтаФорма, Истина, "Партнер");
	смартСервер.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++ #1623 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Форма добавления лида вручную
	Если Объект.Ссылка.Пустая() Тогда
		
		ОткрытьФорму("Документ.смартЛид.Форма.ФормаВводаНовогоЛида");
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	//-- #1623 смарт: Фролов 13.02.2024
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
	Если Элементы.ПричинаСменыОтветственного.Видимость Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ПричинаСменыОтветственного) Тогда
			
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Не заполнена причина смены ответственного!",,"Объект.ПричинаСменыОтветственного");
			Возврат;
			
		КонецЕсли;	
		
	КонецЕсли;
	//-- #1624 смарт: Фролов 16.02.2024
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи); 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	//++ #1624 смарт: Фролов 21.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
	Элементы.ОчиститьСменуОтветственного.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Партнер) Тогда
		
		УстановитьПартнераВЗаметки();
		
	КонецЕсли;
	//-- #1624 смарт: Фролов 21.02.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
//++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОповещениеОНовомПартнереЛиду" ТОгда
		
		Если Источник.ВладелецФормы = ЭтаФорма Тогда
			
			Если Параметр.СозданиеВыполнено	ТОгда
				
				Объект.Партнер = Параметр.ПартнерВыбор;
				Объект.КонтактноеЛицо = Параметр.КонтактноеЛицо;
				Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
				Элементы.СоздатьКлиента.Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1624 смарт: Фролов 13.02.2024

#КонецОбласти

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
//++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура СоздатьКлиента(Команда)
	
	ПараметрыКИ = Новый Структура;
	СтруктураКИ = Новый Структура;
	СтруктураКИ.Вставить("Телефон", Объект.Телефон);
	СтруктураКИ.Вставить("ЭлектроннаяПочта", Объект.ЭлектроннаяПочта);
	СтруктураКИ.Вставить("Имя", Объект.Имя);
	СтруктураКИ.Вставить("БизнесРегион", Объект.БизнесРегион);
	СтруктураКИ.Вставить("ОсновнойМенеджер", Объект.Ответственный);
	ПараметрыКИ.Вставить("КонтактныеДанныеЛида", СтруктураКИ);
	
	ОткрытьФорму("Справочник.Партнеры.Форма.ПомощникНового", ПараметрыКИ, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-- #1624 смарт: Фролов 13.02.2024

&НаКлиенте
//++ #1624 смарт: Фролов 14.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ЗавершенУспешно(Команда)
	
	Проверка = ПроверитьУспешно();
		
	Если Проверка Тогда
		
		Объект.СостояниеЛида = ПредопределенноеЗначение("Перечисление.смартСостоянияЛидов.ЗавершенУспешно");
		ЭтаФорма.Элементы.ПричинаОтклонения.ОтметкаНезаполненного = Ложь;
		УстановитьВидимостьДоступностьЭлементов();
		
	КонецЕсли;
	
КонецПроцедуры //-- #1624 смарт: Фролов 14.02.2024

&НаСервере
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Функция ПроверитьУспешно()
	
	Проверка = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		
			ОбщегоНазначения.СообщитьПользователю("Для успешного завершения лида необходимо заполнить клиента!",,"Объект.Партнер");
			Проверка = Ложь;

	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
		
			ОбщегоНазначения.СообщитьПользователю("Для успешного завершения лида необходимо заполнить контактное лицо!",,"Объект.КонтактноеЛицо");
			Проверка = Ложь;
			
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Заметки
	|ГДЕ
	|	смартИсточник = &Лид
	|	И НЕ ЭтоГруппа
	|	И НЕ ПометкаУдаления");
	Запрос.УстановитьПараметр("Лид", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Для успешного завершения лида необходимо заполнить заметку с информацией по результату обработки!");
		Проверка = Ложь;
			
	КонецЕсли;
	
	Возврат Проверка;
	
КонецФункции //-- #1624 смарт: Фролов 16.02.2024	

&НаКлиенте 
//++ #1624 смарт: Фролов 14.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ЗавершенНеУспешно(Команда)
	
	Проверка = ПроверитьНеУспешно();
	
	Если Проверка Тогда
		
		Объект.СостояниеЛида = ПредопределенноеЗначение("Перечисление.смартСостоянияЛидов.ЗавершенНеУспешно");
		ЭтаФорма.Элементы.ПричинаОтклонения.ОтметкаНезаполненного = Истина;
		УстановитьВидимостьДоступностьЭлементов();
		
	КонецЕсли;
	
КонецПроцедуры //-- #1624 смарт: Фролов 14.02.2024

&НаСервере
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Функция ПроверитьНеУспешно()
	
	Проверка = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПричинаОтклонения) Тогда
		
			ОбщегоНазначения.СообщитьПользователю("Не заполнена причина отклонения!",,"Объект.ПричинаОтклонения");
			Проверка = Истина;
			
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Заметки
	|ГДЕ
	|	смартИсточник = &Лид
	|	И НЕ ЭтоГруппа
	|	И НЕ ПометкаУдаления");
	Запрос.УстановитьПараметр("Лид", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Для успешного завершения лида необходимо заполнить заметку с информацией по результату обработки!");
		Проверка = Ложь;
			
	КонецЕсли;
	
	Возврат Проверка;
	
КонецФункции //-- #1624 смарт: Фролов 16.02.2024

&НаКлиенте
//++ #1624 смарт: Фролов 14.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ПартнерПриИзменении(Элемент)
	
	Если Объект.Партнер.Пустая() Тогда
		
		Элементы.СоздатьКлиента.Видимость = Истина;
		
	Иначе	
		
		Элементы.СоздатьКлиента.Видимость = Ложь;
		
	КонецЕсли;
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры //-- #1624 смарт: Фролов 14.02.2024

&НаКлиенте
//++ #1624 смарт: Фролов 15.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура СоздатьЗаметку(Команда)
	
	ОткрытьФорму("Справочник.Заметки.ФормаОбъекта", Новый Структура("Предмет, ЗаметкаЛенты, смартИсточник", Объект.Партнер, Истина, Объект.Ссылка), ЭтаФорма, , , , Новый ОписаниеОповещения("ПослеСозданияНовойЗаметки", ЭтаФорма));
	
КонецПроцедуры //-- #1624 смарт: Фролов 15.02.2024

&НаКлиенте
//++ #1624 смарт: Фролов 15.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ПослеСозданияНовойЗаметки(Результат, ДопПараметры) Экспорт
	
	Элементы.Заметки.Обновить();
	
КонецПроцедуры //-- #1624 смарт: Фролов 15.02.2024

&НаКлиенте
//++ #1624 смарт: Фролов 15.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ИсторияЛидовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФорму("Документ.смартЛид.Форма.ФормаДокумента", Новый Структура("Ключ", Элемент.ТекущиеДанные.Ссылка));
	
КонецПроцедуры //-- #1624 смарт: Фролов 15.02.2024

&НаСервере
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура УстановитьПартнераВЗаметки()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Заметки
	|ГДЕ
	|	смартИсточник = &Лид");
	Запрос.УстановитьПараметр("Лид", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбЗаметка = Выборка.Ссылка.ПолучитьОбъект();
		ОбЗаметка.Предмет = Объект.Партнер;
		ОбЗаметка.Записать();
		
	КонецЦикла;
	
КонецПроцедуры //-- #1624 смарт: Фролов 16.02.2024	

&НаКлиенте
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если НЕ ПроверитьДоступностьРоли("смартДобавлениеИзменениеКвалификацийМенеджеров") Тогда
		
		ПредыдущийОтветственный = ВернутьПредыдущегоОтветственного();
		
		Если НЕ Объект.Ответственный = ПредыдущийОтветственный Тогда
			
			ПараметрыФормы = Новый Структура("Ответственный, ПредыдущийОтветственный", Объект.Ответственный, ПредыдущийОтветственный);	
			ОткрытьФорму("Документ.смартЛид.Форма.ФормаПередачиДругомуОтветственному", ПараметрыФормы, ЭтаФорма, , , , Новый ОписаниеОповещения("ПослеВыбораНовогоОтветственного", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1624 смарт: Фролов 16.02.2024

&НаСервере
//++ #1624 смарт: Фролов 21.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Функция ПроверитьДоступностьРоли(РольДляПроверки)

	Возврат Ложь;//Пользователи.РолиДоступны(РольДляПроверки);
	
КонецФункции //-- #1624 смарт: Фролов 21.02.2024

&НаКлиенте
//++ #1624 смарт: Фролов 21.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ПослеВыбораНовогоОтветственного(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Объект.ПричинаСменыОтветственного) Тогда
		
		Элементы.ДекорацияСменаОтветственного.Заголовок = "Передал: " + Объект.ПредыдущийОтветственный + Символы.ПС +
			"Причина: " + Объект.ПричинаСменыОтветственного;
		
		Элементы.ГруппаСманаОтветственного.Видимость = Истина;
		Элементы.ДекорацияСменаОтветственного.Видимость = Истина;
		Элементы.ОчиститьСменуОтветственного.Видимость = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры //-- #1624 смарт: Фролов 21.02.2024

&НаКлиенте
//++ #1624 смарт: Фролов 21.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ОчиститьСменуОтветственного(Команда)
	
	Объект.Ответственный = Объект.ПредыдущийОтветственный;
	Объект.ПричинаСменыОтветственного = Неопределено;
	Элементы.ГруппаСманаОтветственного.Видимость = Ложь;
	
КонецПроцедуры //-- #1624 смарт: Фролов 21.02.2024

&НаСервере
Функция ВернутьПредыдущегоОтветственного()

	Возврат Объект.Ссылка.Ответственный;
	
КонецФункции	

&НаКлиенте
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура СформироватьПисьмо(Команда)
	
	Если ЗначениеЗаполнено(Объект.ЭлектроннаяПочта) Тогда
		
		СписокАдресов = Новый СписокЗначений;
		СписокАдресов.Добавить(Объект.ЭлектроннаяПочта, Объект.ЭлектроннаяПочта);
		
		ПараметрыФормы = Новый Структура("Основание", ЭтаФорма.Объект.Ссылка);
		ПараметрыФормы.Вставить("ДанныеЗаполнения", ЭтаФорма.Объект.Ссылка);
		ПараметрыФормы.Вставить("Кому", СписокАдресов);
		
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Электронная почта не заполнена!");
		
	КонецЕсли;
	
КонецПроцедуры //-- #1624 смарт: Фролов 16.02.2024

&НаКлиенте
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура Позвонить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Телефон) Тогда
		
		сфпСофтФонПроКлиент.сфпПозвонить(Объект.Телефон);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Телефон не заполнен!");
		
	КонецЕсли;

КонецПроцедуры //-- #1624 смарт: Фролов 16.02.2024

&НаСервере
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ЗаполнитьСписокВыбораОтветственных()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	смартКвалификацииМенеджеровПользователи.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров.Пользователи КАК смартКвалификацииМенеджеровПользователи
	|ГДЕ
	|	НЕ смартКвалификацииМенеджеровПользователи.Пользователь В
	|				(ВЫБРАТЬ
	|					РегистрСведений.смартКоэффициентыМенеджеров.СрезПоследних.Менеджер КАК Менеджер
	|				ИЗ
	|					РегистрСведений.смартКоэффициентыМенеджеров.СрезПоследних(, ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент))
	|				ГДЕ
	|					РегистрСведений.смартКоэффициентыМенеджеров.СрезПоследних.ВыдачаЗаблокирована)
	|	И смартКвалификацииМенеджеровПользователи.Ссылка.Ссылка = &Квалификация
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартКвалификацииМенеджеровПользователи.Пользователь.Наименование");
	Запрос.УстановитьПараметр("Квалификация", Объект.Квалификация);
	
	Элементы.Ответственный.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь"));
	
КонецПроцедуры	//-- #1624 смарт: Фролов 16.02.2024

&НаКлиенте
//++ #1624 смарт: Фролов 20.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура КвалификацияПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораОтветственных();
	
КонецПроцедуры //-- #1624 смарт: Фролов 20.02.2024

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтаФорма, "Объект.Комментарий");
	
КонецПроцедуры

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь; 
		
	Если СтрДлина(СокрЛП(Текст)) >= 3 Тогда
		
		ДанныеВыбора = смартПолучитьДанныеВыбораБизнесРегиона(Текст); 
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьДанныеВыбораБизнесРегиона(Текст) 
	
	Возврат Справочники.БизнесРегионы.смартПолучитьДанныеВыбораБизнесРегиона(Текст);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда 
		
		ВыбранноеЗначение = смартСоздатьБизнесРегион(ВыбранноеЗначение);  
		
	Иначе
		
		СтруктураВозврата = смартПолучитьУровеньКодСубьектаСправочника(ВыбранноеЗначение); 
		
		Если СтруктураВозврата.Уровень = 0 ИЛИ (СтруктураВозврата.Уровень = 1 И СтруктураВозврата.КодСубъекта <> 0) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для субъектов РФ необходимо выбрать населенный пункт'"));
			
			ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.БизнесРегионы.ПустаяСсылка");  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартСоздатьБизнесРегион(ВыбранноеЗначение) 
	
	Возврат Справочники.БизнесРегионы.смартСоздатьБизнесРегион(ВыбранноеЗначение);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьУровеньКодСубьектаСправочника(ЭлементСправочника) 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Уровень", ЭлементСправочника.Уровень());
	СтруктураВозврата.Вставить("КодСубъекта", ЭлементСправочника.СмартКодСубъектаРФ);
	
	Возврат СтруктураВозврата;

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьУсловноеОформление()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Элементы.ДокументОснование.Видимость = Истина;
		Элементы.ДекорацияДокументСозданВручную.Видимость = Ложь;
		
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") 
			И Объект.ДокументОснование.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
			HTMLТекст = "<!DOCTYPE html>
				|<html lang=""ru"">
				|<head>
				|
				|</head>
				|<body>" + Объект.ТекстИсточника+"</body>
				|</html>";
			
			ТекстИсточникаHTML = HTMLТекст;
			Элементы.ТекстИсточникаTXT.Видимость = Ложь;
			Элементы.ТекстИсточникаHTML.Видимость = Истина;
		Иначе
			Элементы.ТекстИсточникаTXT.Видимость = Истина;
			Элементы.ТекстИсточникаHTML.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		//Переопределение видимости реквизита формы "Документ основание"
		Элементы.ДокументОснование.Видимость = Ложь;
		Элементы.ДекорацияДокументСозданВручную.Видимость = Истина;
		
		Если Объект.Ссылка = Документы.смартЛид.ПустаяСсылка() Тогда
			Элементы.ДекорацияДокументСозданВручную.Заголовок = "Документ заполняется вручную";
		КонецЕсли;
		//Переопределение видимости реквизита формы "Документ основание"
		
		Элементы.ТекстИсточникаTXT.Видимость = Истина;
		Элементы.ТекстИсточникаHTML.Видимость = Ложь;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	УстановитьВидимостьДоступностьЭлементов();
		
КонецПроцедуры

&НаСервере
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	//++ смарт:Каратеев 01.02.2024 //Временное переопределение доступности на время тестирования для ручного заполнения Лидов
	//Удалить этот кусок, когда будет реализована форма ручного добавления лидов.
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		Элементы.Имя.ТолькоПросмотр = Ложь;
		Элементы.Телефон.ТолькоПросмотр = Ложь;
		Элементы.ЭлектроннаяПочта.ТолькоПросмотр = Ложь;
		Элементы.Продукт.ТолькоПросмотр = Ложь;
		Элементы.ИсточникПолученияЛида.ТолькоПросмотр = Ложь;
		Элементы.Тема.ТолькоПросмотр = Ложь; 
		//++ #Б-5036 смарт: Фролов 21.11.2025 //Убрать создание лида при создании интереса из заказа клиента.
		Элементы.Распределил.ТолькоПросмотр = Истина;
		//-- #Б-5036 смарт: Фролов 21.11.2025
		
	КонецЕсли;
	//-- смарт:Каратеев 01.02.2024 //Временное переопределение доступности на время тестирования для ручного заполнения Лидов
	
	Если НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеКвалификацийМенеджеров") Тогда
		
		Если ЗначениеЗаполнено(Объект.Партнер) Тогда
			
			Элементы.Партнер.ТолькоПросмотр = Истина;
			Элементы.КонтактноеЛицо.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
		Элементы.ДокументОснование.Гиперссылка = Ложь;
		Элементы.БизнесРегион.ТолькоПросмотр = Истина;
		Элементы.Квалификация.ТолькоПросмотр = Истина;
		Элементы.СостояниеЛида.ТолькоПросмотр = Истина;
		Элементы.Ответственный.ТолькоПросмотр = Объект.Ответственный <> ПараметрыСеанса.ТекущийПользователь;
		
		Если Объект.СостояниеЛида = Перечисления.смартСостоянияЛидов.ЗавершенУспешно
			ИЛИ Объект.СостояниеЛида = Перечисления.смартСостоянияЛидов.ЗавершенНеУспешно Тогда
			
				Элементы.ЗавершенНеУспешно.Доступность = Ложь;
				Элементы.ЗавершенУспешно.Доступность = Ложь;
				Элементы.Партнер.ТолькоПросмотр = Истина;
				Элементы.КонтактноеЛицо.ТолькоПросмотр = Истина;
				Элементы.ПричинаОтклонения.ТолькоПросмотр = Истина;
				Элементы.Ответственный.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ПричинаСменыОтветственного) Тогда
		
		Элементы.ДекорацияСменаОтветственного.Заголовок = "Передал: " + Объект.ПредыдущийОтветственный + Символы.ПС +
			"Причина: " + Объект.ПричинаСменыОтветственного;
		Элементы.ГруппаСманаОтветственного.Видимость = Истина;
		
		Элементы.Ответственный.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеКвалификацийМенеджеров");
		
	КонецЕсли;
	
КонецПроцедуры //-- #1624 смарт: Фролов 16.02.2024

&НаСервере
//++ #2013 смарт: Фролов 23.08.2024 //При изменении КЛ в Лиде подставлять Партнера
Процедура КонтактноеЛицоПриИзмененииНаСервере()
	Объект.Партнер = Объект.КонтактноеЛицо.Владелец;	
КонецПроцедуры //-- #2013 смарт: Фролов 23.08.2024

&НаКлиенте
//++ #2013 смарт: Фролов 23.08.2024 //При изменении КЛ в Лиде подставлять Партнера
Процедура КонтактноеЛицоПриИзменении(Элемент)
	КонтактноеЛицоПриИзмененииНаСервере();
КонецПроцедуры //-- #2013 смарт: Фролов 23.08.2024

#КонецОбласти
